from tkinter.constants import E


vehicle = [
"电瓶车",
"飞机",
"船",
"电动车",
"小轿车",
"卡车",
]

arms = [
"步枪",
"手枪",
"突击步枪",
"冲锋枪",
"火箭筒",
"地雷"
]

electronics = [
"手机",
"电脑",
"键盘",
"鼠标",
"程序",
"桌面",
"文件夹",
"潜水",
"任务栏",
"u盘"
]

graphical = [
"三角形",
"正方形",
"长方形",
"圆形",
"椭圆形",
"平行四边形",
]

subject = [
"语文",
"数学",
"英语",
"化学",
"地理",
"物理",
"历史",
"生物",
]

missile = [
"地对空导弹",
"空对地导弹",
"空对空导弹",
"洲际巡航导弹",
"小型导弹",
"中型导弹",
"大型导弹"
]

aquatic = [
"水母",
"蓝鲸",
"剑鱼",
"鲨鱼",
"小丑鱼",
"河豚",
"乌贼",
"海豚"
]

occupation = [
"医生",
"护士",
"警察",
"特工",
"农民",
"老师",
"司机",
"机长"
]

terrestrial_animals = [
"老虎",
"狮子",
"蛇",
"豹子",
"斑马",
"骆驼",
"角马",
"梅花鹿",
"麋鹿",
"棕熊",
"北极熊",
"企鹅",
"猴子",
"野猪",
"猞猁",
"狼"
]

dinosaur = [
"翼龙",
"剑龙",
"马门溪龙",
"霸王龙",
"棘龙",
"三角龙",
"肿头龙",
"腕龙",
"羽王龙",
"甲龙"
]

weather = [
"暴雨",
"多云",
"阵雨",
"台风",
"晴天",
"冰雹",
"雪"
]

changzhen_rocket = [
"长征二号丙",
"长征二号丁",
"长征二号F",
"长征三号甲",
"长征三号乙",
"长征三号丙",
"长征四号乙",
"长征四号丙",
"长征一号",
"长征二号",
"长征二号E",
"长征三号",
"长征四号甲",
"长征五号",
"长征五号B",
"长征六号",
"长征七号",
"长征七号甲",
"长征八号",
"长征十一号"
]


words = {
    "0":"vehicle",
    "1":"arms",
    "2":"electronics",
    "3":"graphical",
    "4":"subject",
    "5":"missile",
    "6":"aquatic",
    "7":"occupation",
    "8":"terrestrial_animals",
    "9":"dinosaur",
    "10":"weather",
    "11":"changzhen_rocket"
}